<a href="https://colab.research.google.com/github/parth1614/Machine_Learning/blob/main/SimpleLinear_without_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

*

In [ ]:
import pandas as pd
import numpy as np
import os
square_feet = [1400,1600,1700,1875,1100,1550,2350,2450,1425,1700]
House_price = [245,312,279,308,199,219,405,324,319,255]

df = pd.DataFrame(data = [square_feet, House_price])
df1 = df.T
df1.columns = ['SquareFeet', 'HousePrice']

In [ ]:
df1.head()

   SquareFeet  HousePrice
0        1400         245
1        1600         312
2        1700         279
3        1875         308
4        1100         199

In [ ]:
from sklearn.preprocessing import StandardScaler
def scale_down(df):
    scaler = StandardScaler()
    scaled = scaler.fit_transform(df)
    df['SquareFeet'] = scaled[:, 1] 
    df['HousePrice'] = scaled[:, 1]
    return df
df1 = scale_down(df1)

In [ ]:
from sklearn.model_selection import train_test_split
X = df1.iloc[:, :-1]
y = df1.iloc[:, 1]
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [ ]:
X_train

   SquareFeet
4   -1.532484
9   -0.551694
1    0.446610
6    2.075421
7    0.656779
3    0.376553
0   -0.726835
5   -1.182202

In [ ]:
X_test

   SquareFeet
2   -0.131356
8    0.569208

In [ ]:
y_train

4   -1.532484
9   -0.551694
1    0.446610
6    2.075421
7    0.656779
3    0.376553
0   -0.726835
5   -1.182202
Name: HousePrice, dtype: float64

In [ ]:
y_test

2   -0.131356
8    0.569208
Name: HousePrice, dtype: float64

In [ ]:
X_train

   SquareFeet
4   -1.532484
9   -0.551694
1    0.446610
6    2.075421
7    0.656779
3    0.376553
0   -0.726835
5   -1.182202

In [ ]:
X_test

   SquareFeet
2   -0.131356
8    0.569208

In [ ]:
A = X_train.T.dot(X_train)
B = np.linalg.inv(A)
C = B.dot(X_train.T)
beta = C.dot(y_train)
print(beta)

[1.]

In [ ]:
y_predict = X_test.dot(beta)
print(y_predict)

2   -0.131356
8    0.569208
dtype: float64

In [ ]:
error = y_test-y_predict
square_error = np.power(error,2)
sum_square_error = np.sum(square_error)
mean_square_error = sum_square_error / len(y_predict)
print(mean_square_error)
rms_error = np.sqrt(mean_square_error)
print(rms_error)
y_mean = np.mean(y_test)
total_sumofsquares = np.sum((y_test-y_mean)**2)
print(1-sum_square_error/ total_sumofsquares)

6.548161810916602e-33
8.092071311423672e-17
1.0

## **Question 2**

In [ ]:
df2 = pd.read_csv('C:\\Users\\kdubelite\\Desktop\\College\\Semester 5\\Machine Learning\\Lab\\Datasets\\Stock_Price.csv')
df2.head()

   Year  Month  Interest_Rate  Unemployment_Rate  Stock_Index_Price
0  2017     12           2.75                5.3               1464
1  2017     11           2.50                5.3               1394
2  2017     10           2.50                5.3               1357
3  2017      9           2.50                5.3               1293
4  2017      8           2.50                5.4               1256

In [ ]:
df2['Year'] = df2['Year'].map({2017 : 1, 2016 : 2})

In [ ]:
X1 = df2.iloc[:, :-1]
y1 = df2.iloc[:,-1]

In [ ]:
from sklearn.model_selection import train_test_split
X1_train, X1_test, y1_train, y1_test = train_test_split(X1, y1, test_size = 0.2, random_state = 0)

In [ ]:
X1_train

    Year  Month  Interest_Rate  Unemployment_Rate
1      1     11           2.50                5.3
13     2     11           1.75                5.9
23     2      1           1.75                6.1
16     2      8           1.75                6.2
8      1      4           2.25                5.5
6      1      6           2.50                5.5
17     2      7           1.75                6.1
4      1      8           2.50                5.4
2      1     10           2.50                5.3
5      1      7           2.50                5.6
18     2      6           1.75                6.1
9      1      3           2.25                5.6
7      1      5           2.25                5.5
19     2      5           1.75                6.1
3      1      9           2.50                5.3
0      1     12           2.75                5.3
21     2      3           1.75                6.2
15     2      9           1.75                6.1
12     2     12           2.00                6.0

In [ ]:
X1_test

    Year  Month  Interest_Rate  Unemployment_Rate
11     1      1           2.00                5.9
10     1      2           2.00                5.7
22     2      2           1.75                6.2
14     2     10           1.75                5.8
20     2      4           1.75                5.9

In [ ]:
y1_train

1     1394
13     965
23     719
16     971
8     1159
6     1234
17     949
4     1256
2     1357
5     1254
18     884
9     1167
7     1195
19     866
3     1293
0     1464
21     822
15     958
12    1047
Name: Stock_Index_Price, dtype: int64

In [ ]:
y1_test

11    1075
10    1130
22     704
14     943
20     876
Name: Stock_Index_Price, dtype: int64

In [ ]:
A1 = X1_train.T.dot(X1_train)
B1 = np.linalg.inv(A1)
C1 = B1.dot(X1_train.T)
beta1 = C1.dot(y1_train)
print(beta1)

[-391.57353661   30.07859539  137.24396223  203.82829979]

In [ ]:
y_predict1 = X1_test.dot(beta1)
print(y_predict1)

11    1115.579952
10    1104.892887
22     780.922510
14     940.019953
20     779.931211
dtype: float64

In [ ]:
error1 = y1_test-y_predict1
square_error = np.power(error,2)
sum_square_error = np.sum(square_error)
mean_square_error = sum_square_error / len(y_predict1)
print("Mean Square Error = " + mean_square_error)
rms_error = np.sqrt(mean_square_error)
print("Root Mean Square Error = " +rms_error)
y_mean1 = np.mean(y1_test)
total_sumofsquares = np.sum((y1_test-y_mean1)**2)
print(1-sum_square_error/ total_sumofsquares)

2.6192647243666407e-33
5.1178752665209035e-17
1.0